list() #изменяемый, список
a=['orange','apple','melon','bomb','Apple']
tuple() #неизменяемый, кортеж
b=('apple','elon','orange')
dict() #словарь изменяемый, ключ:значение (key)
c={'apple':2,'melon':1,'Jhon': 'Constantinov','key': [1,3,4,5,6,7]}
set() #изменяемые, множества, каждый элемент уникальный
d={'apple','melon','orange',}

#              СПИСОК == МНОЖЕСТВО
# a.append('water') добавляет элемент в список
# a.remove('apple') удаляет элемент списка
# index = a.pop(1) удаляет последний элемент из списка
# apple = a.index('apple') показывает индекс элемента
# a.reverse() меняет местами задом наперед
# a2 = a.copy() копирует список
# a.sort() сортирует список по заглавным буквам и алфавиту или числам
# apple = a.index('apple') показывает индекс элемента
# count = b.count() показывает количество одинаковых элементов в кортеже
# name = sorted(a) присваивает сортированный список переменной
#              СЛОВАРЬ
# index = b.index('orange') показывает индекс элемента в словаре
# keys = c.keys() вывод только ключей
# values = c.values() вывод только значений 
# items = c.items() вывод всех элементов в словаре
# get = c.get('key') вывод значения ключа по названию
# pop = c.pop('key') удаляет элемент в словаре
# c.clear() очищает список, работает со всеми сложными типами данных
#              МНОЖЕСТВО
# d.add('water') добавляет в множество элемент
#                 СО ВСЕМИ
# count = b.count() показывает количество одинаковых элементов в списке
# index = b.index('orange') показывает индекс элемента в словаре

